rf-eng/micropython/ports/stm32/machine_i2s.c
    uint16_t dma_buffer_index = 0;
    if (dma_ping_pong == TOP_HALF) {
        dma_buffer_index = 0;  
    } else { // BOTTOM_HALF
        dma_buffer_index = SIZEOF_DMA_BUFFER_IN_BYTES/2; 
    }
    
    mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    
    // copy a block of samples from the active buffer to the dma buffer.
    // mono format is implemented by duplicating each sample into both L and R channels.
    // (STM32 HAL API has a stereo I2S implementation, but not mono)
    
    if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_16B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/4; // TODO - really confusing -- fix
        uint16_t *dma_buffer_p_tmp = (uint16_t *)self->dma_buffer;
        uint16_t *dma_buffer_p = &dma_buffer_p_tmp[dma_buffer_index];

        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint16_t *active_buffer_p = (uint16_t *)temp2;

        for (uint32_t i=0; i<samples_to_copy; i++) {
            dma_buffer_p[i*2] = active_buffer_p[i]; 
            dma_buffer_p[i*2+1] = active_buffer_p[i]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;  // TODO - really confusing -- fix
        
    } else if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_32B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/8;
        uint32_t *dma_buffer_p_tmp = (uint32_t *)self->dma_buffer;
        uint32_t *dma_buffer_p = &dma_buffer_p_tmp[dma_buffer_index];
        
        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint32_t *active_buffer_p = (uint32_t *)temp2;
        
        for (uint32_t i=0; i<samples_to_copy; i++) {
            dma_buffer_p[i*2] = active_buffer_p[i]; 
            dma_buffer_p[i*2+1] = active_buffer_p[i]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;
        
    } else { // STEREO, both 16-bit and 32-bit
        uint8_t *dma_buffer_p_tmp = self->dma_buffer;
        uint8_t *dma_buffer_p = &dma_buffer_p_tmp[dma_buffer_index];
        
        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint8_t *active_buffer_p = (uint8_t *)temp2;
        
        memcpy(dma_buffer_p,  
               active_buffer_p, 
               SIZEOF_DMA_BUFFER_IN_BYTES/2);
        
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2;
    }
    
    // 32 bit samples need to be reformatted to match STM32 HAL API requirements for I2S
    // TODO  SIZEOF_DMA_BUFFER_IN_BYTES/2  <--- make a macro for this
    if (self->bits == I2S_DATAFORMAT_32B) {
        uint8_t *dma_buffer_p_tmp = self->dma_buffer;
        machine_i2s_reformat_32_bit_samples((int32_t *)(&dma_buffer_p_tmp[dma_buffer_index]), SIZEOF_DMA_BUFFER_IN_BYTES/2/4);
    }
    
    // has active buffer been emptied?
    if (self->active_buffer_index >= bufinfo.len) {
        // clear buffer and push to idle queue
        memset(bufinfo.buf, 0, bufinfo.len);
        enqueue(&self->idle_queue, self->active_buffer);
        self->active_buffer = NULL;
        i2s_handle_mp_callback(self);  // TODO "handle" <-- get better word
    }
}

#if 0
static void led_flash_error(int colour, int count) {
    for(;;) {
        for (int c=0;c<count;c++) {
            led_state(colour, 1);
            HAL_Delay(300);
            led_state(colour, 0);
            HAL_Delay(300);
        }
        HAL_Delay(2000);
    }
}

static void led_flash_info(int colour, int count) {
    for (int c=0;c<count;c++) {
        led_state(colour, 1);
        HAL_Delay(300);
        led_state(colour, 0);
        HAL_Delay(300);
    }
}
#endif

// assumes init parameters are set up correctly
STATIC bool i2s_init(machine_i2s_obj_t *i2s_obj) {
    #if defined (USE_SAI)
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    /**SAI1_A_Block_A GPIO Configuration
    PE5     ------> SAI1_SCK_A
    PE4     ------> SAI1_FS_A
    PB2     ------> SAI1_SD_A
    */
    GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_4;
    GPIO_InitStruct.Alternate = GPIO_AF6_SAI1;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_2;
    GPIO_InitStruct.Alternate = GPIO_AF6_SAI1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /**SAI1_B_Block_B GPIO Configuration
     PE3     ------> SAI1_SD_B
    */
    GPIO_InitStruct.Pin = GPIO_PIN_3;
    GPIO_InitStruct.Alternate = GPIO_AF6_SAI1;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
    #else
    // init the GPIO lines
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
    GPIO_InitStructure.Pull = GPIO_PULLUP;

    if (i2s_obj->i2s_id == 1) {  // TODO replace magic number with Macro ... or use spi_find_index()?
        i2s_obj->i2s.Instance = I2S1;
        __SPI1_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        // TODO what to do when application tries to configure both I2S and SPI features on SPI1?

        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            i2s_obj->rx_dma_descr = &dma_I2S_1_RX;
        } else {
            i2s_obj->tx_dma_descr = &dma_I2S_1_TX;
        }
    } else if (i2s_obj->i2s_id == 2) {
        i2s_obj->i2s.Instance = I2S2;
        __SPI2_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            i2s_obj->rx_dma_descr = &dma_I2S_2_RX;
        } else {
            i2s_obj->tx_dma_descr = &dma_I2S_2_TX;
        }
    } else {
        // invalid i2s_id number; shouldn't get here as i2s object should not
        // have been created without setting a valid i2s instance number
        return false;
    }

    // GPIO Pin initialization
    if (i2s_obj->sck != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->sck->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->sck, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->sck->gpio, &GPIO_InitStructure);
    }
    
    if (i2s_obj->ws != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->ws->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->ws, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->ws->gpio, &GPIO_InitStructure);
    }
    
    if (i2s_obj->sd != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->sd->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->sd, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->sd->gpio, &GPIO_InitStructure);
    }
    #endif

    // Configure and enable I2SPLL - I2S_MASTER modes only:
    // ====================================================
    // References for STM32F405 (pybv10 and pybv11):
    //    1) table 127 "Audio frequency precision" of RM0090 Reference manual
    //    2) lines 457-494 of STM32Cube_FW_F4_V1.5.0/Drivers/BSP/STM32F4-Discovery/stm32f4_discovery_audio.c
    //
    // References for STM32F722 (PYBD-SF2W) and STM32F723 (PYBD-SF3W)
    //    1) table 204 "Audio-frequency precision" of RM0385 Reference manual
    //
    // References for STM32F767 (PYBD-SF6W)
    //    1) table 229 "Audio-frequency precision" of RM0410 Reference manual

    //    48kHz family is accurate for 8, 16, 24, and 48kHz but not 32 or 96
    //    44.1kHz family is accurate for 11.025, 22.05 and 44.1kHz but not 88.2

    // TODO: support more of the commonly-used frequencies and account for 16/32 bit frames
    // TODO: Refactor to use macros as provided by stm32f4xx_hal_rcc_ex.h
    
#if defined (STM32F405xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SR__)
    __HAL_RCC_PLLI2S_DISABLE();
    if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
        __HAL_RCC_PLLI2S_CONFIG(384, 5); // TODO
    } else {
        __HAL_RCC_PLLI2S_CONFIG(429, 4); // TODO
    }
        __HAL_RCC_PLLI2S_ENABLE();
#elif defined (STM32F722xx) || defined (STM32F723xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SQ__, __PLLI2SR__)
    // TODO can PLL config be set "per channel"?
    __HAL_RCC_PLLI2S_DISABLE();
    if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
        __HAL_RCC_PLLI2S_CONFIG(384, 1, 5); // TODO
    } else {
        __HAL_RCC_PLLI2S_CONFIG(429, 1, 4); // TODO
    }
        __HAL_RCC_PLLI2S_ENABLE();
#elif defined (STM32F767xx)
#error I2S not yet supported on the STM32F767xx processor (future)
#else
    #if !defined (USE_SAI)
    #error I2S does not support this processor
    #endif
#endif // STM32F405xx

    #if defined (USE_SAI)
    __HAL_RCC_SAI1_CLK_DISABLE();
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
    PeriphClkInitStruct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
    {
        printf("error periph clk config");
    }
    __HAL_RCC_SAI1_CLK_ENABLE();
    i2s_obj->i2s.Instance = AUDIO_INSTANCE_1;
    i2s_obj->tx_dma_descr = &dma_I2S_2_TX;    
    #else
    
    #endif
    if (HAL_AUDIO_INIT(&i2s_obj->i2s) == HAL_OK) {
        // Reset and initialize Tx and Rx DMA channels

        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            // Reset and initialize rx DMA
            dma_invalidate_channel(i2s_obj->rx_dma_descr);

            dma_init(&i2s_obj->rx_dma, i2s_obj->rx_dma_descr, DMA_PERIPH_TO_MEMORY, &i2s_obj->i2s);
            i2s_obj->i2s.hdmarx = &i2s_obj->rx_dma;
#if 0
            // set I2S Rx DMA interrupt priority
            if (i2s_obj->i2s_id == 1) {
                NVIC_SetPriority(DMA1_Stream3_IRQn, (IRQ_PRI_DMA+1));
                HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
            } else if (i2s_obj->i2s_id == 2) {
                //NVIC_SetPriority(DMA2_Stream3_IRQn, (IRQ_PRI_DMA+1));
                //NVIC_SetPriority(DMA1_Stream3_IRQn, (IRQ_PRI_DMA+1)); // lower DMA priority
                HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
            } else {
                // invalid i2s_id number; shouldn't get here as i2s object should not
                // have been created without setting a valid i2s instance number
                return false;
            }
#endif
        } else {
            // Reset and initialize tx DMA
            dma_invalidate_channel(i2s_obj->tx_dma_descr);

            dma_init(&i2s_obj->tx_dma, i2s_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, &i2s_obj->i2s);
            i2s_obj->i2s.hdmatx = &i2s_obj->tx_dma;

