rf-eng/micropython/ports/stm32/machine_i2s.c
// TODO move all the pin stuff to the start of the file
// Construct an I2S object on the given bus.  `bus` can be 1 or 2.
// I2S requires a clock pin (SCK), a word select pin (WS) and
// a data pin (SD).
//
// Alternate Function (AF) Pin Mappings for I2S on pyboards
//
// Valid pins for I2S on the pyboard, models v1.0, v1.1:
// see alternate function mapping in datasheet
// TODO check pin availability
//     SCK -   B13 / Y6,  PB10 / Y9,       (SPI2 SCK)
//     WS -    B12 / Y5,  PB9  / Y4,       (SPI2 NSS)
//     SD -    B15 / Y8,  PC3  / X22       (SPI2 MOSI)
//   - `SPI(1)` is on the X position: `(NSS, SCK, MISO, MOSI) = (X5, X6, X7, X8) = (PA4, PA5, PA6, PA7)`
//   - `SPI(2)` is on the Y position: `(NSS, SCK, MISO, MOSI) = (Y5, Y6, Y7, Y8) = (PB12, PB13, PB14, PB15)`


//
// Valid pins for I2S on the pyboard D, models SF2W, SF3W:
// see alternate function  mapping in datasheet
// TODO check pin availability on DIP28 and DIP68 boards
//     SCK -   A5  / W6 / X6,  PB3  / --     (SPI1 SCK)
//     WS -    A4  / --,  PA15 / --     (SPI1 NSS)
//     SD -    A7  / --,  PB5  / --     (SPI1 MOSI)
//
//     SCK -   A9  / --,  PB13 / --,  PB10 / --,  PD3 / --  (SPI2 SCK)
//     WS -    PB12 / Y5,  PB9  / --                        (SPI2 NSS)
//     SD -    PB15 / --,  PC3  / --,  PC1 / --,  PC3 / --   (SPI2 MOSI)
//
//     SCK -   PB3  / --,  PC10 / --,   / --,   / --  (SPI3 SCK)
//     WS -    PA4 / ,  PA15  / --                        (SPI3 NSS)
//     SD -    PB5 / --, PC12   / --,   PD6/ --,   / --   (SPI3 MOSI)


//
// The I2S3 port is disabled by default on the pyboard, as its pins would
// conflict with the SD Card and other pyboard functions.
//
STATIC mp_obj_t machine_i2s_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    mp_arg_check_num(n_pos_args, n_kw_args, 1, MP_OBJ_FUN_ARGS_MAX, true);

    machine_i2s_obj_t *self;
    
    // note: it is safe to assume that the arg pointer below references a positional argument because the arg check above
    //       guarantees that at least one positional argument has been provided
    uint8_t i2s_id = mp_obj_get_int(args[0]);  // TODO i2s_id has values 1,2,3 for STM32 ...different than ESP32 e.g.  0,1
    if (i2s_id == 1) { // TODO fix magic number 
        self = &machine_i2s_obj[0];
    } else if (i2s_id == 2) { // TODO fix magic number 
        self = &machine_i2s_obj[1];
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S ID is not valid"));
    }

    self->base.type = &machine_i2s_type;
    self->i2s_id = i2s_id;

    // is I2S peripheral already in use?
    if (self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is already in use"));
    }

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw_args, args + n_pos_args);
    // note:  "args + 1" below has the effect of skipping over the ID argument
    machine_i2s_init_helper(self, n_pos_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_i2s_init(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    // note:  "pos_args + 1" below has the effect of skipping over "self"
    machine_i2s_init_helper(pos_args[0], n_pos_args - 1, pos_args + 1, kw_args);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2s_init_obj, 1, machine_i2s_init);

// TODO is returning None "pythonic" when no buffer is available?
STATIC mp_obj_t machine_i2s_getbuffer(mp_obj_t self_in) {
    machine_i2s_obj_t *self = self_in;

    if (!self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is not initialized")); // TODO needed?
    }
    
    //if (self->mode != I2S_MODE_MASTER_TX) {
    //    mp_raise_ValueError(MP_ERROR_TEXT("I2S not configured for write method"));
    //}
    
    // For TX mode, remove from idle queue. For RX mode, add to active queue 
    if (self->mode == I2S_MODE_MASTER_TX) {
        // remove from idle queue 
        // TODO change way of doing this ... try to remove with dequeue(), then test for true/false ...false = queue is full... can then 
        // eliminate isEmpty() routine
        if (isEmpty(&self->idle_queue)) {
            return mp_const_none;
        } else {
            mp_obj_t buffer = dequeue(&self->idle_queue);
            return buffer;
        }
    } else { // RX
        // remove from active queue 
        // TODO change way of doing this ... try to remove with dequeue(), then test for true/false ...false = queue is full... can then 
        // eliminate isEmpty() routine
        if (isEmpty(&self->active_queue)) {
            return mp_const_none;
        } else {
            mp_obj_t buffer = dequeue(&self->active_queue);
            return buffer;  
        }
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_i2s_getbuffer_obj, machine_i2s_getbuffer);



STATIC mp_obj_t machine_i2s_putbuffer(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_buf };
    // TODO check that buffer size is multiple of 1/2 dma buffer size e.g  128 bytes
    
    // TODO check:  is buffer passed in one of the buffer supplied in the constructor?
    STATIC const mp_arg_t allowed_args[] = {
        { MP_QSTR_buf, MP_ARG_REQUIRED | MP_ARG_OBJ,  {.u_obj = mp_const_none} }, 
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(args), allowed_args, args);

    machine_i2s_obj_t *self = pos_args[0];

    if (!self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is not initialized"));  // needed?
    }
    
    //if (self->mode != I2S_MODE_MASTER_TX) {
    //    mp_raise_ValueError(MP_ERROR_TEXT("I2S not configured for write method"));
    //}
    
    mp_buffer_info_t bufinfo;
    mp_get_buffer(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_WRITE);
    
    // For TX mode, add to active queue. For RX mode, add to inactive queue 
    if (self->mode == I2S_MODE_MASTER_TX) {
        // add buffer to queue 
        // TODO change way of doing this ... try to add with enqueue(), then test for true/false ...false = queue is full... can then 
        // eliminate isFull() routine
        if (isFull(&self->active_queue)) {
            mp_raise_ValueError(MP_ERROR_TEXT("Nogo - active queue is friggen full - end of the road bud"));
        }
        
        enqueue(&self->active_queue, args[ARG_buf].u_obj);
    } else { // RX
        // add buffer to queue 
        // TODO change way of doing this ... try to add with enqueue(), then test for true/false ...false = queue is full... can then 
        // eliminate isFull() routine
        if (isFull(&self->idle_queue)) {
            mp_raise_ValueError(MP_ERROR_TEXT("Nogo - inactive queue is friggen full - end of the road bud"));
        }
        
        // TODO likely memset the buffer to all 0s ?
        enqueue(&self->idle_queue, args[ARG_buf].u_obj);
    }

    return mp_const_none;  
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2s_putbuffer_obj, 2, machine_i2s_putbuffer);

STATIC mp_obj_t machine_i2s_start(mp_obj_t self_in) {  // TODO(?) self_in ---> self
    machine_i2s_obj_t *self = self_in;
    
    // TODO - add error checks ... for example, when this is called when no buffers exist in the queue
    // or:  has already been started and start() is called again
    // OR ... allow calling when no buffers exist and it's already running
    
    mp_buffer_info_t bufinfo;
    
    // TODO maybe do nothing is start() is called when it's already started?
    // - this could remove need to call isAvailable() in python code

